; This is the English language file for Open File shell for TC application, version 1.8b
; Information for translators.

; New lines (v1.8b -> v1.8c) are marked with the "; new" comments (above these lines),
; changed lines are marked with the "; changed" comment.
; Also, part of new strings is marked with the "; new (*)" symbols. While OpenFileTC
; wa in test, some translators have maked a temporary .lng-files. This mark show them
; all new strings. If you didn't make temp. translations, then do not make an attention on 
; this symbol - translate this string as new

; It's recommended to save this language file in Unicode. But if ANSI code works correctly
; in your country, then you can save language file in this code page.
;
; You can use "/s;" string (3 symbols, without quotes) to make a break in string.

; --------------------------------------------- ;
;						;
; Version 1.8c					;
;       					;
;   No important changes                      	;
;						;
; --------------------------------------------- ;
 
[Misc]           ; info about author of this language file. Please fill all fields correctly and put here info only about YOU :)
 ; language name, must be in your native letters
0=English        
 ; name of translator (man or company)
1=Antoon_Inc company     
 ; supported OpenFileTC version
2=1.8c            
 ; your contact information and copyrights. Will be enable only here, don't be published in OpenFileTC 
3=(C) Copyright, 2004-2008. All Rights Reserved. E-Mail: oftc@antoon-inc.com, ICQ: 207-298-917  
 ; OpenFileTC discussing forum in your native language (if it exists)
5=http://ghisler.ch/board/viewtopic.php?t=10026

[MainUnit]       ; strings and messages for main window
0=Open file %FileName% with...
1=Preferred applications
2=Other applications
3=Hot key
4=Lost applications
5=Another application...
6=Select application:
7=The selected file is not executable applicaiton!/s;You've selected: "%ProgramName%"./s;It's file type (extension) is not EXE./s;Do you really want to use this file?
8=Application:
9=Extensions:
10=Full path:
11=Application is not found!
12=Edit associations
13=Change the path to application
14=Rename
15=Hot key:
16=Remove from list
17=Renaming
18=New name:
19=Do you really want to remove application "%ProgramName%"/s;from the avaliable applications list?
20=Attention: Application Total Commander has been found on your machine./s;You can set Open File shell for TC application as the default editor for Total Commander./s;%NowStandProgram%/s;Advantages:/s;- every file can be opened via F4 with the most SUITABLE editor/s;- simple associations setup/s;- OpenFileTC is not meddlesome/s;/s;If you become interested in this advantages then just press YES./s;Application will make any necessary actions for you. /s;This question won't be asked any more.
21=Thanks for your choice!/s;/s;If you have some instances of Total Commander which are work now,/s;please, restart them. Changes will be apllied after restarting Total Commander.
22=Attention: DbCD Universal has been found on your machine./s;You can set Open File shell for TC application as the default viewer for DbCD Universal./s;%NowStandProgram%/s;Advantages:/s;- every file can be opened via F3 with the most SUITABLE viewer/s;- simple associations setup/s;- OpenFileTC is not meddlesome/s;/s;If you become interested in this advantages then just press YES./s;Application will make any necessary actions for you. /s;This question won't be asked any more.
23=Thanks for your choice!/s;/s;If you have some instances of DbCD Universal which are in work now,/s;please, restart them. Changes will be apllied after restarting DbCD Universal.
24=Add application which knows /s;how to read file %FileName%
25=Always use selected application for current extension
26=Setup %ProgramName%
27=Open, but don't spy for app
28=Open in %ProgramName%
29=Calls count:
30=You have launched application without parameters./s;It's not recommended to add applications in this mode./s;/s; Do you still want to add new element to the list?
31=Do not show selection window for %FileType% files any more./s;Open file with selected application right now
32=OK
33=Setup OpenFileTC
34=Cancel
35=Sort by
36=Kind
37=Show icons
38=Setup condition
39=Now you are using: "%ProgramName%"
40=List of all applications
41=Editing of executable/s;/s;OpenFileTC has received an executable file:/s;%FileName%/s;Do you want to add this file to the list of OpenFileTC's editors?/s;/s;Press YES if you want to add this editor to the list of editors/s;Press NO to edit this file
42=Application will be shown in a window
43=Unable to create groups for application's elements. There may be errors in application.
44=Unable to create settings file "%INIFileName%"./s;May be you have running application from read-only device (such as CD-ROM or DVD-ROM), or settings file is protected from writing new information./s;Application will save all settings into folder "%WinFolder%"
45=An error occured while creating settings file./s;File name: "%INIFileName%"./s;System message: "%SystemMessage%"./s;Error class: "%ClassMessage%"./s;/s;Application will be closed.
46=Application opens only the first /s;file from the list, without quotes
47=Application opens only the first /s;file from the list, with quotes
48=Each file will be opened with the /s;individual instance of application, without quotes
49=Each file will be opened with the /s;individual instance of application, with quotes
50=Application will be minimized to the task bar
51=Add application which knows /s;how to read files of selected format
52=Application will be maximized
53=Hide tool bar
54=Add new editor
55=Setup editor
56=Delete editor from list
57=Open File shell for TC settings
58=Recognize "%type%" type as supported
59=Remove "%type%" type from supported
60=Since version 1.8b, OpenFileTC has obtained an ability to recognize applications and set them needed run type./s;This ability allows to remove an old bug when some apps are stay in RAM when they have been started via OpenFileTC/s;/s;OpenFileTC can check now all your application. Do you want it? /s;/s;YES - check and made needed changes/s;NO - no changes will be maded/s;CANCEL - ask this question lately
61=Notepad
62=OpenFileTC can''t create directory of ini-file,/s;which you have set in the command line:/s;/s;   %OriginalINI%/s;/s;Now OpenFileTC use basic ini-file:/s;/s;   %BasicINI%
 ; new
63=Hide tools panel
 ; new
64=Show tools panel

[EditExtsUnit]   ; here strings and messages for extensions tuner window
0=Editing extensions for application "%ProgramName%"
1=OK
2=Cancel
3=Add
4=Edit
5=Remove
6=New extension
7=Extension:
8=Open in %ProgramName% right now
9=Open applications' selection window
10=OpenFileTC's action
11=Type
12=Command line
13=Allowed variables:/s;/s;%1, %FullFileName% - full file name/s;%FileName% - only file name (without path AND extension)/s;%FileExt% - file extension (without dot)/s;All variables are case insensitive

[SetupUnit]    ; setup window
0=Open File shell for TC settings
1=Language:
2=Fonts and colors
3=Elements:
4=Select language from the list of avaliable languages./s;You can download more languages from http://antoon-inc.com/oftc/
5=Sections
6=Icons
7=List
8=Small icons
9=Report
10=Load icons
11=Show icons from applications
12=Apply
13=Apply all changes
14=OK
15=Save changes and close this window
16=Cancel
17=Close this window without saving changes
18=Each user has its own settings
19=Use this option to separate OpenFileTC settings /s;between all users of this computer
20=If this file exists then each user of this computer has its own settings for OpenFileTC application. If you want to use same settings for all users then delete this file. This comment can be erased.
21=Font...
22=Type, size and color for main window's labels
23=Background
24=Main window's background color
25=Cache icons
26=Load icons from executables only one time/s;and save them inside Icons subfolder (recommended)
27=Misc
28=Tuning
29=About
30=Select icon's view
31=Don't spy for executables
32=Don't wait while runned executable/s;finish its work with opened file
33=Show tool tips near the mouse
34=By default, tooltips for executables/s;are shown in the corner of the OpenFileTC window
35=Show tool tips
36=Show tips for applications when/s;move mouse over them in the main window
37=Main window:
38=Dialogs:
39=Type, color and size for other windows' texts
40=Sort type of elements in main window:
41=Choose sorting type for/s;added applications in main window
42=Alphabetically
43=By rate
44="Each user has its own settings" option will be activated after OpenFileTC restart
45=Variants for forced application calling
46=Hold this key:
47=If this key is held, then/s;OpenFileTC will always show its window
48=Hold mouse cursor at the:
49=If mouse cursor is at the selected corner, then/s;OpenFileTC will always show its window
50=Select mouse position from this list
51=Select switch key from the list
52=top-Left screen corner
53=top-Right screen corner
54=bottom-Left screen corner
55=bottom-Right screen corner
56=Enable support to open directories
57=Allow to open selected folders using F4 key./s;Enable the tag %Dir% as the supported extension./s;More info you can read at the .chm help-file
58=State of "Always use selected application..." check box :
59=Here you can set the state of this/s;check box for each OFTC start. You can/s;always has this item switched on, always/s;switched off, or remember your check/s;box change
60=Remember last user's choice
61=Always switched off
62=Always switched on
63=Add executable to the list of editors if user press F4 on it
64=If user begins to edit EXE-file,/s;then OpenFileTC will ask user to add/s;this EXE to the list of editors
65=Home page:
66=Forum:
67=Show tool bar
68=Show panel with buttons in the main window
 ; new
69=Transparency
 ; new
70=Set transparency for all windows
 ; new
71=Only for the main window
 ; new
72=Set transparency only for the main OpenFileTC window
 ; new
73=Disable background for main window
 ; new
74=Set background fully transparent
 ; new
75=Select application under mouse
 ; new
76=Highlight application when mouse is over it

[HotKeyUnit]    ; hot keys window
0=Hot key
1=Setup a hot key to run application %ProgramName%
2=Current hot key:
3=New hot key:
4=OK
5=Save changes and close this window
6=Cancel
7=Close this window without saving changes
8=no
9=This hot key is reserved by OpenFileTC and can't be used
10=This hot key is already in use by application %ProgramName%./s;Do you want to setup this hot key for %CurrProgramName% and remove it from the previous one?

[ProgramSettingsUnit]    ; Window for settings of one selected executable
0=%ProgramName% properties
1=Name:
2=Application's path:
3=Command line for all extensions:
4=OpenFileTC don't find specified executive file/s;Please validate entered path
5=Please name here this application
6=Full path to executable file
7=Select file
8=Solving the problem with opening files
9=No problem
10=There is no problems with opening/s;several files in this application
11=Send to application only the first file from the whole list, WITHOUT quotes
12=Send to the command line of executable not the whole/s;file list, but the only first file from this list, WITHOUT quotes
13=Send to application only the first file from the whole list, WITH quotes
14=Send to the command line of executable not the whole/s;file list, but the only first file from this list, WITH quotes
15=Run new application's instance for each file, pass file name WITH quotes
16=Run several copies of this application,/s;every copy will get one file from list as hte command line parameter./s;ATTENTION: in this case OpenFileTC will stop to trace for executables. /s; WITH quotes
17=Extensions...
18=Setup extensions' list for this application
19=OK
20=Save changes and close this window
21=Cancel
22=Close this window without saving changes
23=Run new application's instance for each file, pass file name WITHOUT quotes
24=Run several copies of this application,/s;every copy will get one file from list as hte command line parameter./s;ATTENTION: in this case OpenFileTC will stop to trace for executables. /s; WITHOUT commas
25=Click on the image to select/s;another resource file
26=Select a file with icons
27=Save file to...
28=Hot key...
29=Set a key combination to select/s;this app in the OpenFileTC window
30=Set this command line/s;for all extensions
31=Put here a command line for all extensions of this application
32=Change icon
33=Save icon to file...
34=Window's look when it opens (work of this option is not guaranteed):
35=By default
36=In a window
37=Minimized
38=Maximized
39=Open all new extensions in this editor directly
40=If OpenFileTC don't found any editor/s;for file with some extension, then this file/s;will be opened directly in this editor
 ; new
41=Set this command line for all supported extensions of this editor?

[FoundClipUnit]
0=Found clipboard
1=ID of information in clipboard: %BufferID%
2=Predetermined types:
3=Attention: you have an unrecognized information in clipboard. Please, try to recognize the infomation type of clipboard. Use the popup list above to recognize the type.
4=Recognize automatically (experimental!)
5=Try to recognize data type automatically (not recommended)
6=Select
7=Data type was recognized successfully
8=Not found
9=Data type wasn't recognized
10=Text ( ANSI )
11=Text ( OEM )
12=Text ( UNICODE )
13=Image ( BMP )
14=Image ( JPG )
15=Image ( TIFF )
16=Metafile
17=Unknown block